--------------------------------------------------------------------------------
-- Lesson #001 | cool trnslation
--------------------------------------------------------------------------------
1. and ['и']                                 21. nil ['отсутствие']
2. array ['массив']                          22. not ['не']
3. begin ['начало']                          23. or ['или']
4. case ['вариант']                          24. of ['из']
5. const ['константа']                       25. procedure ['процедура']
6. div ['деление']                           26. program ['программа']
7. goto ['переход']                          27. record ['запись']
8. do ['выполнить']                          28. repeat ['повторять']
9. downto ['уменьшить до']                   29. set ['множество']
10. else ['иначе']                           30. string ['строка']
11. end ['конец']                            31. then ['то']
12. file ['файл']                            32. to ['увеличивая']
13. for ['для']                              33. type ['тип']
14. function ['функция']                     34. unit ['модуль']
15. if ['если']                              35. until ['до']
16. implementation ['реализация']            36. uses ['использовать']
17. in ['в']                                 37. var ['переменная']
18. interface ['интерфейс']                  38. while ['пока']
19. label ['метка']                          39. with ['с']
20. mod ['остаток от деления']

--------------------------------------------------------------------------------
-- Lesson #002 | useful functions
--------------------------------------------------------------------------------
1. arctan(x) = arctg(x)                       9. pred(x)   = x - 1 ( x == 0.11 | pred(x) == 0.10 )                
2. sqrt(x)   = √x                            10. succ(x)   = x + 1 ( x == 0.11 | succ(x) == 0.12 )
3. sin(x)    = sin(x)                        11. trunc(x)  = x := 1.023 ( trunc(x) := 1 )   
4. cos(x)    = cos(x)                        12. round(x)  = rounds "x" to closest number 
5. exp(x)    = e^x                           13. odd(x)    = false/true | even/odd  
6. abs(x)    = |x|                           14. inc(x, i) = x := x + i
7. sqr(x)    = x²                            15. dec(x, i) = x := x - i
8. ln(x)     = ln(x)

